mbocaneg/STM32-Chip8/Src/SSD1306/SSD1306_defs.h
/*
 * SSD1306_defs.h
 *
 *  Created on: Aug 7, 2019
 *      Author: icaruss
 */

#ifndef SSD1306_SSD1306_DEFS_H_
#define SSD1306_SSD1306_DEFS_H_

#include <inttypes.h>
#include <stdbool.h>
#include <string.h>

/*
 * ssd1306 device addresses and common commands
 * */
#define SSD1306_DEFAULT_ADDRESS 0x78
#define SSD1306_SETCONTRAST 0x81
#define SSD1306_DEACTIVATE_SCROLL 0x2E
#define SSD1306_DISPLAYALLON_RESUME 0xA4
#define SSD1306_DISPLAYALLON 0xA5
#define SSD1306_NORMALDISPLAY 0xA6
#define SSD1306_INVERTDISPLAY 0xA7
#define SSD1306_DISPLAYOFF 0xAE
#define SSD1306_DISPLAYON 0xAF
#define SSD1306_SETDISPLAYOFFSET 0xD3
#define SSD1306_SETCOMPINS 0xDA
#define SSD1306_SETVCOMDETECT 0xDB
#define SSD1306_SETDISPLAYCLOCKDIV 0xD5
#define SSD1306_SETPRECHARGE 0xD9
#define SSD1306_SETMULTIPLEX 0xA8
#define SSD1306_SETLOWCOLUMN 0x00
#define SSD1306_SETHIGHCOLUMN 0x10
#define SSD1306_SETSTARTLINE 0x40
#define SSD1306_MEMORYMODE 0x20
#define SSD1306_COLUMNADDR 0x21
#define SSD1306_PAGEADDR   0x22
#define SSD1306_COMSCANINC 0xC0
#define SSD1306_COMSCANDEC 0xC8
#define SSD1306_SEGREMAP 0xA0
#define SSD1306_CHARGEPUMP 0x8D
#define SSD1306_SWITCHCAPVCC 0x2
#define SSD1306_NOP 0xE3

/*
 * Dimensions pertaining to the ssd1306 pixel resolution
 * */
#define SSD1306_WIDTH 128
#define SSD1306_HEIGHT 64
#define GFX_BUF_LEN 1024

#endif /* SSD1306_SSD1306_DEFS_H_ */
